back-end/myRails/rails_api_training/student_pracice/app/controllers/api/v1/students_controller.rb

	def create
		@student=Student.new(student_params)
		if @student.save
---
INSERT INTO "students" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sachin"], ["age", 21], ["created_at", "2016-11-03 04:19:16.733449"], ["updated_at", "2016-11-03 04:19:16.733449"]]