back-end/myRails/project/library_management/app/controllers/books_controller.rb

INSERT INTO "books" ("book_name", "author", "publication", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["book_name", "book1"], ["author", "me"], ["publication", "hello"], ["created_at", "2016-10-26 10:15:39.121866"], ["updated_at", "2016-10-26 10:15:39.121866"]]
---
	def create
		@book=Book.new(book_params)
		# binding.pry
		@book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@book=Book.find_by_id(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "books" SET "publication" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["publication", "boscos mangalore"], ["updated_at", "2016-10-27 05:42:37.700966"], ["id", 2]]
---
	def update
		# binding.pry
		@book=Book.find_by_id(params[:id])
		@book.update_attributes(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 4]]
---
	def destroy
		@book=Book.find_by_id(params[:id])
		@book.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 2]]
---
	def show
		@book=Book.find_by_id(params[:id])