back-end/myRails/project/myproj/app/controllers/employees_controller.rb

	def create
		# binding.pry
		@employee=Employee.new()
		@employee.fname=params["employee"]["fname"]
		@employee.lname=params["employee"]["lname"]
		@employee.eid=params["employee"]["eid"]
		@employee.save
---
INSERT INTO "employees" ("fname", "lname", "eid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["fname", "ram"], ["lname", "mani"], ["eid", 111], ["created_at", "2016-10-21 09:23:55.966874"], ["updated_at", "2016-10-21 09:23:55.966874"]]

	def index
		@employee=Employee.all
---
SELECT "employees".* FROM "employees"