back-end/myRails/association/association_mgmt/app/controllers/companies_controller.rb

	def create
		@company=Company.new(company_params)
		@company.save
---
INSERT INTO "companies" ("company_name", "company_city", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["company_name", "qwinix"], ["company_city", "mysore"], ["created_at", "2016-11-04 05:09:47.650354"], ["updated_at", "2016-11-04 05:09:47.650354"]]