back-end/myRails/association/association_mgmt/app/controllers/employees_controller.rb

INSERT INTO "employees" ("employee_name", "employee_age", "employee_city", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["employee_name", "harshita"], ["employee_age", "22"], ["employee_city", "mysore"], ["company_id", 1], ["created_at", "2016-11-04 06:52:06.613293"], ["updated_at", "2016-11-04 06:52:06.613293"]]
---
	def create
		@employee=Employee.new(employee_params)
		@employee.company_id=@company.id
		@employee.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", nil]]
---
	def find_company
		# binding.pry
		@company=Company.find_by_id(params[:company_id])