back-end/myRails/rails_api_training/student_blog/app/controllers/api/v1/students_controller.rb

INSERT INTO "students" ("student_name", "student_usn", "student_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["student_name", "sachin"], ["student_usn", "4vm12cs034"], ["student_address", "nanjangud"], ["created_at", "2016-11-02 10:38:54.014660"], ["updated_at", "2016-11-02 10:38:54.014660"]]
---
			def create
				@student=Student.new(student_params)
				if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "students" SET "student_address" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["student_address", "mysore"], ["updated_at", "2016-11-02 11:44:33.923157"], ["id", 1]]
---
			def update
				@student=Student.find_by_id(params[:id])
				@student.update_attributes(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 3]]
---
			def destroy
				@student=Student.find_by_id(params[:id])
				@student.destroy